/*두 수가 주어졌을때 각 숫자가 거꾸로 읽어졌을때 대소비교*/
#include <stdio.h>

int main() 
{
	int x, y, x2, y2;    
	int f[2], m[2], l[2], i;

	scanf("%d %d", &x, &y); //두개의 숫자 입력

	for (i = 0; i < 2; i++) 
	{
		f[0] = x / 100; //x의백의자리
		m[0] = (x % 100) / 10; //x의십의자리
		l[0] = (x % 100) % 10; //x의일의자리

		x2 = ((l[0] * 100) + (m[0] * 10) + f[0]); //숫자를 거꾸로 나열

		f[1] = y / 100; //y의백의자리
		m[1] = (y % 100) / 10; //y의십의자리
		l[1] = (y % 100) % 10; //y의일의자리

		y2 = ((l[1] * 100) + (m[1] * 10) + f[1]);

	}



	if (x2 > y2) 
		printf("%d", x2);

	else
		printf("%d", y2);
}